org/digital_tools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-02 火 09:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>数理情報科学特論 デジタルツール (コンピュータと数式処理)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="suzuki@iwate-u.ac.jp suzuki@iwate-u.ac.jp 鈴木正幸，岩手大学・非常勤講師" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/sos/css/sos.css">
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">数理情報科学特論 デジタルツール (コンピュータと数式処理)</h1>


<div id="outline-container-org3725fad" class="outline-2">
<h2 id="org3725fad">メモと思考とデジタル技術</h2>
<div class="outline-text-2" id="text-org3725fad">
<p>
2018.12月の放送大学面接講義の内容です。
</p>

<p>
コンピュータとインターネットを利用して，
考え，メモを作成することについて，考えてみます。
</p>

<ul class="org-ul">
<li>講義 <a href="https://github.com/masayuki054/tools_for_thinking_and_memo">GitHub - masayuki054/tools_for_thinking_and_memo</a></li>
<li>内容 <a href="https://masayuki054.github.io/tools_for_thinking_and_memo/talk.html">メモと思考とデジタルツール</a></li>
</ul>
</div>

<div id="outline-container-org62f3623" class="outline-4">
<h4 id="org62f3623">思考とメモと文書作成のためのデジタル・ツール</h4>
<div class="outline-text-4" id="text-org62f3623">
</div>
<div id="outline-container-org630b5e4" class="outline-5">
<h5 id="org630b5e4">MindMapping</h5>
</div>

<div id="outline-container-org7070b64" class="outline-5">
<h5 id="org7070b64">outliner</h5>
<div class="outline-text-5" id="text-org7070b64">
<p>
<a href="./outline-reading-writing.html">./outline-reading-writing.html</a>
</p>
</div>

<div id="outline-container-org2f7ad8e" class="outline-6">
<h6 id="org2f7ad8e">emacs org - アウトライナー</h6>
<div class="outline-text-6" id="text-org2f7ad8e">
</div>
<div id="outline-container-orgc7730c5" class="outline-7">
<h7 id="orgc7730c5">Org Babelで文芸的プログラミング · ops●tokyo</h7>
<div class="outline-text-7" id="text-orgc7730c5">
<p>
<a href="http://wallyqs.github.io/posts/2014/12/12/using-org-babel-for-lp-jp/">Org Babelで文芸的プログラミング · ops●tokyo</a>
素晴しい!
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orga7147d3" class="outline-5">
<h5 id="orga7147d3">markup</h5>
<div class="outline-text-5" id="text-orga7147d3">
<ul class="org-ul">
<li>simplenote</li>
<li>Emacs org-mode</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa8a3c0" class="outline-5">
<h5 id="orgfa8a3c0">HyperLink</h5>
</div>
</div>
</div>


<div id="outline-container-org6cc0190" class="outline-2">
<h2 id="org6cc0190">クラウドと情報リテラシー</h2>
<div class="outline-text-2" id="text-org6cc0190">
<p>
2019.12月の放送大学面接講義の内容です。
</p>

<p>
クラウド時代の知的情報リテラシーについて考えてみる
</p>

<ul class="org-ul">
<li>講義 <a href="https://github.com/masayuki054/cloud_and_information_literacy">GitHub - masayuki054/cloud_and_information_literacy</a></li>
<li>内容 <a href="https://masayuki054.github.io/cloud_and_information_literacy/talk.html">クラウドと情報リテラシー</a></li>
</ul>
</div>
</div>


<div id="outline-container-org3c73699" class="outline-2">
<h2 id="org3c73699">メモ，思考，情報リテラシのまとめ</h2>
<div class="outline-text-2" id="text-org3c73699">
<ul class="org-ul">
<li>講義  <a href="https://github.com/masayuki054/ict_literacy_for_thinking_and_memo">GitHub - masayuki054/ict_literacy_for_thinking_and_memo</a></li>
<li>内容  <a href="https://masayuki054.github.io/ict_literacy_for_thinking_and_memo/">メモと思考のためのICTの活用</a></li>
</ul>
</div>

<div id="outline-container-org928e94e" class="outline-3">
<h3 id="org928e94e">理解を外化するためにコンピュータとインターネットを使おう</h3>
<div class="outline-text-3" id="text-org928e94e">
<p>
小さな理解のくりかえしを，構造的に記録する
</p>
</div>
</div>

<div id="outline-container-org51116f1" class="outline-3">
<h3 id="org51116f1">内化しやすい外化</h3>
<div class="outline-text-3" id="text-org51116f1">
</div>
<div id="outline-container-org430735b" class="outline-4">
<h4 id="org430735b">理解しやすい外化</h4>
<div class="outline-text-4" id="text-org430735b">
<p>
outline 
</p>
</div>
</div>

<div id="outline-container-orge8ac578" class="outline-4">
<h4 id="orge8ac578">イメージしやすい外化</h4>
<div class="outline-text-4" id="text-orge8ac578">
<p>
mindmap
</p>
</div>
</div>
</div>

<div id="outline-container-org6ad9b1b" class="outline-3">
<h3 id="org6ad9b1b">外化の意味付</h3>
<div class="outline-text-3" id="text-org6ad9b1b">
<ul class="org-ul">
<li>情報を外に出すことは二つの意味がある

<ul class="org-ul">
<li><p>
内的情報を外部記憶に置くこと
</p>

<p>
こっちが外化, これがメモ
</p></li>

<li><p>
自分の情報を他者が理解できる形にすること
</p>

<p>
第三者への情報 客観化，文書化
</p></li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgc00425a" class="outline-4">
<h4 id="orgc00425a">理解と知識と外化</h4>
<div class="outline-text-4" id="text-orgc00425a">
<ul class="org-ul">
<li>小さな理解と大きな理解，整合性の問題</li>
<li>理解の再帰性</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org959db6a" class="outline-3">
<h3 id="org959db6a">コンピュータとインターネットの意味</h3>
<div class="outline-text-3" id="text-org959db6a">
<ul class="org-ul">
<li>検索</li>

<li>可視化</li>

<li>編集と保存</li>

<li>補完と拡張</li>
</ul>
</div>
</div>

<div id="outline-container-org72522ee" class="outline-3">
<h3 id="org72522ee">思考方法</h3>
<div class="outline-text-3" id="text-org72522ee">
<ul class="org-ul">
<li>抽象化と詳細化，</li>

<li>論理的思考</li>

<li>水平思考，放射思考</li>

<li>発想法</li>
</ul>
</div>
</div>

<div id="outline-container-orgb423dfe" class="outline-3">
<h3 id="orgb423dfe">知的思考の7段階</h3>
<div class="outline-text-3" id="text-orgb423dfe">
<ul class="org-ul">
<li>目的探索</li>
<li>観察</li>
<li>発想</li>
<li>分析</li>
<li>構造化</li>
<li>意志決定</li>
<li>表現</li>
</ul>
</div>
</div>
<div id="outline-container-org7e981a4" class="outline-3">
<h3 id="org7e981a4">情報処理</h3>
<div class="outline-text-3" id="text-org7e981a4">
<ul class="org-ul">
<li>情報の収集</li>
<li>情報の加工</li>
<li>情報の分析</li>
<li>情報の獲得 (自分の情報にする)</li>
<li>情報の生成 (第三者にわかる情報にする)</li>
<li>情報の発信</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp suzuki@iwate-u.ac.jp 鈴木正幸，岩手大学・非常勤講師</p>
<p class="date">Created: 2021-11-02 火 09:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
